app/Controllers/Admin/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `plans`
SELECT COUNT(*) AS `numrows`
FROM `plans`
WHERE `status` = 1
SELECT SUM(`slots_used`) AS `slots_used`
FROM `enrollments`
SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function index()
    {
        $this->protect();

        $planModel   = new PlanModel();
        $enrollModel = new EnrollmentModel();
        $userModel   = new UserModel();

        // 1️⃣ Total plans
        $totalPlans = $planModel->countAllResults();

        // 2️⃣ Open plans
        $openPlans = $planModel->where('status', 1)->countAllResults();

        // 3️⃣ Total slots filled
        $totalEnrollments = $enrollModel
            ->selectSum('slots_used')
            ->get()
            ->getRow()
            ->slots_used ?? 0;

        // 4️⃣ Total users
        $totalUsers = $userModel->countAllResults();