app/Controllers/Admin/PlanPageContent.php

SELECT *
FROM `plan_page_content`
 LIMIT 1
---
    public function index()
    {
        $this->protect();

        $model = new PlanPageContentModel();

        return view('admin/plan_page_content/edit', [
            'title'      => 'Plan Page Content',
            'activePage' => 'plan_page_content',
            'content'    => $model->first()