app/Models/PlanModel.php

    public function getAllPlans()
    {
        return $this->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `plans`
ORDER BY `id` DESC